package lesson2;

public class Primitives {

    public static void main(String[] args) {
        // Типи даних

        // Логічні значення
        boolean answer, answer2; // boolean - логічне значення
        answer = true; // Істина -> 1
        answer2 = false; // Фальш -> 0

        // Цілі числа
        //Byte - байт(8 біт)
        byte maxByte = 127;
        byte minByte = -128;

        //Short - коротке число, яке містить в собі 2 байти, тобто 16 бітів
        short maxShort = 32_767; // _ - лишає теж саме значення, але покращує читаність числа
        short minShort = -32_768;

        //Integer - ціле число, яке містить в собі 4 байти, тобто 32 бітів
        int maxInt = 2_147_483_647;
        int minInt = -2_147_483_648;

        // Long - довге, ціле число, яке містить в собі 8 байтів, тобто 64 бітів
        long maxLong = 9_223_372_036_854_775_807L;
        long minLong = -9_223_372_036_854_775_808L;

        //Питання: "Скільки людей на планеті"
        //Відповідь: Long
        //Питання: "Скільки рук у людини"
        //Відповідь: byte
        //Питання: "Є сигнал?"
        //Відповідь: boolean
        //Питання: "Кількість країн на планеті"
        //Відповідь: short
        //Питання: "Скільки жителів в Монако"
        //Відповідь: int

        // Дробні числа

        //Double - число з точкою що плаває, 64 bit
        double myBottle = 1.5;
        //Float - число з плаваючою точкою, 32 bit
        float cola = 0.33F;

        double doubleNumber = 1.12345678901234567890; // Результат: 1.12345678901234568 (sout - скорочення для коду )
        float floatNumber = 1.12345678901234567890F;  // Результат: 1.1234568

        //Char - character (символ), 16 bit
        char letter = 'я' + 1; // Слово в числах, при виводі буде буква а;

        char newLine = '\n'; // Перенос строки
        char tab = '\t'; // 4 пробіли
        char escape = '\\'; // 1 слеш

        // Var - універсальний тип даних
        var countPeople = 15;

    }


}
